app/controllers/adds_controller.rb

  def index
    @adds = Add.all
---
SELECT "adds".* FROM "adds"

  def show
    @add = Add.find(params[:id])
---
SELECT "adds".* FROM "adds" WHERE "adds"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @add = Add.find(params[:id])
---
SELECT "adds".* FROM "adds" WHERE "adds"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @add = Add.new(params[:add])

    respond_to do |format|
      if @add.save
---
INSERT INTO "adds" ("advertistment", "created_at", "image", "updated_at") VALUES (?, ?, ?, ?)  [["advertistment", "Check out snake genius.com"], ["created_at", Wed, 12 Dec 2012 21:44:55 UTC +00:00], ["image", "snakepicture.jpeg"], ["updated_at", Wed, 12 Dec 2012 21:44:55 UTC +00:00]]

  def update

    @add = Add.find(params[:id])

    respond_to do |format|
      if @add.update_attributes(params[:add])
---
SELECT "adds".* FROM "adds" WHERE "adds"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "adds" SET "advertistment" = 'Snake picture', "image" = 'http://www.constrictors.com/images/BallPythons/FireFly/BPFireFly08M1.jpg', "updated_at" = '2012-12-21 09:42:39.897963' WHERE "adds"."id" = 8

  def destroy
    @add = Add.find(params[:id])
    @add.destroy
---
SELECT "adds".* FROM "adds" WHERE "adds"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "adds" WHERE "adds"."id" = ?  [["id", 1]]