app/controllers/facebook_controller.rb

SELECT "adds".* FROM "adds" WHERE "adds"."id" = ? LIMIT 1  [["id", "8"]]
---
  def fbpostsetup
  	@adds = Add.find(params[:id])